# Social Media Addiction Analysis - Notebook for Data Cleaning

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r"C:\Users\Rano's PC\Machine\github_repo_cloned\Analytics-Project-Repository\social_media_analysis\Students Social Media Addiction.csv")

In [3]:
data.head()

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score
0,1,19,Female,Undergraduate,Bangladesh,5.2,Instagram,Yes,6.5,6,In Relationship,3,8
1,2,22,Male,Graduate,India,2.1,Twitter,No,7.5,8,Single,0,3
2,3,20,Female,Undergraduate,USA,6.0,TikTok,Yes,5.0,5,Complicated,4,9
3,4,18,Male,High School,UK,3.0,YouTube,No,7.0,7,Single,1,4
4,5,21,Male,Graduate,Canada,4.5,Facebook,Yes,6.0,6,In Relationship,2,7

In [4]:
data.columns = data.columns.str.lower()

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 705 entries, 0 to 704
Data columns (total 13 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   student_id                    705 non-null    int64
 1   age                           705 non-null    int64
 2   gender                        705 non-null    object
 3   academic_level                705 non-null    object
 4   country                       705 non-null    object
 5   avg_daily_usage_hours         705 non-null    float64
 6   most_used_platform            705 non-null    object
 7   affects_academic_performance  705 non-null    object
 8   sleep_hours_per_night         705 non-null    float64
 9   mental_health_score           705 non-null    int64
 10  relationship_status           705 non-null    object
 11  conflicts_over_social_media   705 non-null    int64
 12  addicted_score                705 non-null    int64
dtypes: float64(2), int64(5), object(6)
memory usage: 71.7+ KB

In [6]:
data.rename(columns={'academic_level':'education','avg_daily_usage_hours':'daily_usage','most_used_platform':'most_used',
                     'affects_academic_performance':'affected_academics','sleep_hours_per_night':'sleep_per_night',
                     'mental_health_score':'score','relationship_status':'relationship','conflicts_over_social_media':'online_conflicts',
                     'addicted_score':'addiction_score'},inplace=True)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 705 entries, 0 to 704
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   student_id          705 non-null    int64
 1   age                 705 non-null    int64
 2   gender              705 non-null    object
 3   education           705 non-null    object
 4   country             705 non-null    object
 5   daily_usage         705 non-null    float64
 6   most_used           705 non-null    object
 7   affected_academics  705 non-null    object
 8   sleep_per_night     705 non-null    float64
 9   score               705 non-null    int64
 10  relationship        705 non-null    object
 11  online_conflicts    705 non-null    int64
 12  addiction_score     705 non-null    int64
dtypes: float64(2), int64(5), object(6)
memory usage: 71.7+ KB

In [8]:
data.head()

,student_id,age,gender,education,country,daily_usage,most_used,affected_academics,sleep_per_night,score,relationship,online_conflicts,addiction_score
0,1,19,Female,Undergraduate,Bangladesh,5.2,Instagram,Yes,6.5,6,In Relationship,3,8
1,2,22,Male,Graduate,India,2.1,Twitter,No,7.5,8,Single,0,3
2,3,20,Female,Undergraduate,USA,6.0,TikTok,Yes,5.0,5,Complicated,4,9
3,4,18,Male,High School,UK,3.0,YouTube,No,7.0,7,Single,1,4
4,5,21,Male,Graduate,Canada,4.5,Facebook,Yes,6.0,6,In Relationship,2,7

In [9]:
cat_cols = data.select_dtypes(exclude='number').columns
num_cols = data.select_dtypes(include='number').columns

In [10]:
cat_cols

Index(['gender', 'education', 'country', 'most_used', 'affected_academics',
       'relationship'],
      dtype='object')

In [11]:
for col in cat_cols:
    data[col]= data[col].str.upper()

In [12]:
data.head()

,student_id,age,gender,education,country,daily_usage,most_used,affected_academics,sleep_per_night,score,relationship,online_conflicts,addiction_score
0,1,19,FEMALE,UNDERGRADUATE,BANGLADESH,5.2,INSTAGRAM,YES,6.5,6,IN RELATIONSHIP,3,8
1,2,22,MALE,GRADUATE,INDIA,2.1,TWITTER,NO,7.5,8,SINGLE,0,3
2,3,20,FEMALE,UNDERGRADUATE,USA,6.0,TIKTOK,YES,5.0,5,COMPLICATED,4,9
3,4,18,MALE,HIGH SCHOOL,UK,3.0,YOUTUBE,NO,7.0,7,SINGLE,1,4
4,5,21,MALE,GRADUATE,CANADA,4.5,FACEBOOK,YES,6.0,6,IN RELATIONSHIP,2,7

In [13]:
data.drop(columns=['student_id'],inplace=True)

In [14]:
data.head()

,age,gender,education,country,daily_usage,most_used,affected_academics,sleep_per_night,score,relationship,online_conflicts,addiction_score
0,19,FEMALE,UNDERGRADUATE,BANGLADESH,5.2,INSTAGRAM,YES,6.5,6,IN RELATIONSHIP,3,8
1,22,MALE,GRADUATE,INDIA,2.1,TWITTER,NO,7.5,8,SINGLE,0,3
2,20,FEMALE,UNDERGRADUATE,USA,6.0,TIKTOK,YES,5.0,5,COMPLICATED,4,9
3,18,MALE,HIGH SCHOOL,UK,3.0,YOUTUBE,NO,7.0,7,SINGLE,1,4
4,21,MALE,GRADUATE,CANADA,4.5,FACEBOOK,YES,6.0,6,IN RELATIONSHIP,2,7

In [16]:
for col in cat_cols:
    print(f"Column: {col}")
    print(data[col].unique())
    print("-"*30)

Column: gender
['FEMALE' 'MALE']
------------------------------
Column: education
['UNDERGRADUATE' 'GRADUATE' 'HIGH SCHOOL']
------------------------------
Column: country
['BANGLADESH' 'INDIA' 'USA' 'UK' 'CANADA' 'AUSTRALIA' 'GERMANY' 'BRAZIL'
 'JAPAN' 'SOUTH KOREA' 'FRANCE' 'SPAIN' 'ITALY' 'MEXICO' 'RUSSIA' 'CHINA'
 'SWEDEN' 'NORWAY' 'DENMARK' 'NETHERLANDS' 'BELGIUM' 'SWITZERLAND'
 'AUSTRIA' 'PORTUGAL' 'GREECE' 'IRELAND' 'NEW ZEALAND' 'SINGAPORE'
 'MALAYSIA' 'THAILAND' 'VIETNAM' 'PHILIPPINES' 'INDONESIA' 'TAIWAN'
 'HONG KONG' 'TURKEY' 'ISRAEL' 'UAE' 'EGYPT' 'MOROCCO' 'SOUTH AFRICA'
 'NIGERIA' 'KENYA' 'GHANA' 'ARGENTINA' 'CHILE' 'COLOMBIA' 'PERU'
 'VENEZUELA' 'ECUADOR' 'URUGUAY' 'PARAGUAY' 'BOLIVIA' 'COSTA RICA'
 'PANAMA' 'JAMAICA' 'TRINIDAD' 'BAHAMAS' 'ICELAND' 'FINLAND' 'POLAND'
 'ROMANIA' 'HUNGARY' 'CZECH REPUBLIC' 'SLOVAKIA' 'CROATIA' 'SERBIA'
 'SLOVENIA' 'BULGARIA' 'ESTONIA' 'LATVIA' 'LITHUANIA' 'UKRAINE' 'MOLDOVA'
 'BELARUS' 'KAZAKHSTAN' 'UZBEKISTAN' 'KYRGYZSTAN' 'TAJIKISTAN' 'ARMENIA'
 'GEORGIA' 'AZERBAIJAN' 'CYPRUS' 'MALTA' 'LUXEMBOURG' 'MONACO' 'ANDORRA'
 'SAN MARINO' 'VATICAN CITY' 'LIECHTENSTEIN' 'MONTENEGRO' 'ALBANIA'
 'NORTH MACEDONIA' 'KOSOVO' 'BOSNIA' 'QATAR' 'KUWAIT' 'BAHRAIN' 'OMAN'
 'JORDAN' 'LEBANON' 'IRAQ' 'YEMEN' 'SYRIA' 'AFGHANISTAN' 'PAKISTAN'
 'NEPAL' 'BHUTAN' 'SRI LANKA' 'MALDIVES']
------------------------------
Column: most_used
['INSTAGRAM' 'TWITTER' 'TIKTOK' 'YOUTUBE' 'FACEBOOK' 'LINKEDIN' 'SNAPCHAT'
 'LINE' 'KAKAOTALK' 'VKONTAKTE' 'WHATSAPP' 'WECHAT']
------------------------------
Column: affected_academics
['YES' 'NO']
------------------------------
Column: relationship
['IN RELATIONSHIP' 'SINGLE' 'COMPLICATED']
------------------------------

In [17]:
data.describe()

,age,daily_usage,sleep_per_night,score,online_conflicts,addiction_score
count,705.000000,705.000000,705.000000,705.000000,705.000000,705.000000
mean,20.659574,4.918723,6.868936,6.226950,2.849645,6.436879
std,1.399217,1.257395,1.126848,1.105055,0.957968,1.587165
min,18.000000,1.500000,3.800000,4.000000,0.000000,2.000000
25%,19.000000,4.100000,6.000000,5.000000,2.000000,5.000000
50%,21.000000,4.800000,6.900000,6.000000,3.000000,7.000000
75%,22.000000,5.800000,7.700000,7.000000,4.000000,8.000000
max,24.000000,8.500000,9.600000,9.000000,5.000000,9.000000

In [19]:
data['relationship']=data['relationship'].apply(lambda x: 'RELATIONSHIP' if x == 'IN RELATIONSHIP' else x)

In [20]:
data.head()

,age,gender,education,country,daily_usage,most_used,affected_academics,sleep_per_night,score,relationship,online_conflicts,addiction_score
0,19,FEMALE,UNDERGRADUATE,BANGLADESH,5.2,INSTAGRAM,YES,6.5,6,RELATIONSHIP,3,8
1,22,MALE,GRADUATE,INDIA,2.1,TWITTER,NO,7.5,8,SINGLE,0,3
2,20,FEMALE,UNDERGRADUATE,USA,6.0,TIKTOK,YES,5.0,5,COMPLICATED,4,9
3,18,MALE,HIGH SCHOOL,UK,3.0,YOUTUBE,NO,7.0,7,SINGLE,1,4
4,21,MALE,GRADUATE,CANADA,4.5,FACEBOOK,YES,6.0,6,RELATIONSHIP,2,7

In [21]:
data.to_csv(r"C:\Users\Rano's PC\Machine\github_repo_cloned\Analytics-Project-Repository\social_media_analysis\cleaned_data.csv",index=False)